le-taxi-api-tests/src/taxiPositionSnapShots/loadTests/test-position-snapshots-with-25-operators-200-taxis.yaml
config:
  target: 'https://taximtldev.accept.ville.montreal.qc.ca'
  processor: './generateSnapshotsFor25Operators.js'
  http:
    pool: 20
    timeout: 5
  phases:
    - name: '1 500 POST taxi-position-snapshots - 25 operators x 200 taxis'
      # Each virtual user per second will send 1 snapshot / 200 positions.
      # Using 5 virtual users per second will have a total of 5 snapshots / 1,000 positions sent every second.
      # Therefore, we'll be sending a total of 1500 snapshots / 300,000 positions in 5 minutes.
      arrivalRate: 5
      duration: 300 # 300 seconds === 5 minutes
before:
  flow:
    - loop:
      - post:
          url: '/api/taxi-position-snapshots'
          beforeRequest: 'beforeRequestForInitialization'
          json: '{{snapshots}}'
          headers:
            X-VERSION: '2'
            X-API-KEY: '{{operatorApikey}}'
      count: 25
scenarios:
  - name: 'sending snapshots'
    flow:
      - post:
          url: '/api/taxi-position-snapshots'
          beforeRequest: 'beforeRequestForTests'
          json: '{{snapshots}}'
          headers:
            X-VERSION: '2'
            X-API-KEY: '{{operatorApikey}}'